tutorials/16geomParNS_review/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           | Copyright (C) 2018 Ehsan Madadi-Kandjani        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format    ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1.0;
vertices
(
(-8.50014902463 -0.0321447832314 0)
(-0.368019791077 -8.0 0)
(0.500149024632 -8.0 0)
(16.5001490246 -8.0 0)
(16.5001490246 -0.0349196384831 0)
(16.5001490246 8.0 0)
(0.500149024632 8.0 0)
(-0.140515957271 8.0 0)
(-0.500149024632 -0.0321447832314 -0.0)
(-0.140515957271 0.0639086427491 0.0)
(-0.368019791077 -0.0639086427491 -0.0)
(0.500149024632 -0.0349196384831 -0.0)
(-8.50014902463 -0.0321447832314 0.2)
(-0.368019791077 -8.0 0.2)
(0.500149024632 -8.0 0.2)
(16.5001490246 -8.0 0.2)
(16.5001490246 -0.0349196384831 0.2)
(16.5001490246 8.0 0.2)
(0.500149024632 8.0 0.2)
(-0.140515957271 8.0 0.2)
(-0.500149024632 -0.0321447832314 0.2)
(-0.140515957271 0.0639086427491 0.2)
(-0.368019791077 -0.0639086427491 0.2)
(0.500149024632 -0.0349196384831 0.2)
);
blocks
(
// Block 0
hex (0 1 10 8 12 13 22 20)
square
(50 100 1)
simpleGrading
(2 0.02 1)

// Block 1
hex (1 2 11 10 13 14 23 22)
square
(71 100 1)
simpleGrading
(1 0.02 1)

// Block 2
hex (2 3 4 11 14 15 16 23)
square
(100 100 1)
simpleGrading
(100 0.02 1)

// Block 3
hex (11 4 5 6 23 16 17 18)
square
(100 100 1)
simpleGrading
(100 50 1)

// Block 4
hex (9 11 6 7 21 23 18 19)
square
(71 100 1)
simpleGrading
(1 50 1)

// Block 5
hex (8 9 7 0 20 21 19 12)
square
(50 100 1)
simpleGrading
(2 50 1)

);
edges
(
arc 0 7 (-6.15700327412 5.65685424949 0)
arc 0 1 (-6.15700327412 -5.65685424949 0)
arc 12 19 (-6.15700327412 5.65685424949 0.2)
arc 12 13 (-6.15700327412 -5.65685424949 0.2)
spline 8 10
(
(-0.500149024632 -0.0321447832314 -0.0)
(-0.499850975368 -0.0349196384831 -0.0)
(-0.499059486471 -0.0375958362434 -0.0)
(-0.497784205983 -0.0401365768541 -0.0)
(-0.496027948734 -0.0425418503814 -0.0)
(-0.493794006491 -0.0448118299513 -0.0)
(-0.49108613955 -0.0469468720096 -0.0)
(-0.487908566437 -0.0489475177931 -0.0)
(-0.484265951827 -0.0508144959413 -0.0)
(-0.480163392824 -0.0525487261542 -0.0)
(-0.475606403738 -0.0541513237815 -0.0)
(-0.470600899572 -0.0556236052064 -0.0)
(-0.465153178388 -0.0569670938722 -0.0)
(-0.459269902813 -0.0581835267802 -0.0)
(-0.452958080884 -0.0592748612751 -0.0)
(-0.4462250465 -0.060243281922 -0.0)
(-0.439078439723 -0.0610912072686 -0.0)
(-0.431526187169 -0.0618212962806 -0.0)
(-0.423576482751 -0.0624364542334 -0.0)
(-0.415237768997 -0.0629398378421 -0.0)
(-0.406518719177 -0.0633348594147 -0.0)
(-0.397428220435 -0.063625189816 -0.0)
(-0.387975358133 -0.06381476004 -0.0)
(-0.378169401548 -0.063907761199 -0.0)
(-0.368019791077 -0.0639086427491 -0.0)
)
spline 10 11
(
(-0.368019791077 -0.0639086427491 -0.0)
(-0.357536127051 -0.0638221087944 -0.0)
(-0.346728160234 -0.0636531123246 -0.0)
(-0.335605784057 -0.063406847271 -0.0)
(-0.324179028592 -0.0630887382842 -0.0)
(-0.312458056259 -0.0627044281685 -0.0)
(-0.3004531592 -0.0622597629361 -0.0)
(-0.288174758236 -0.0617607744725 -0.0)
(-0.275633403315 -0.0612136608411 -0.0)
(-0.262839775276 -0.0606247642837 -0.0)
(-0.249804688807 -0.0600005470095 -0.0)
(-0.236539096375 -0.0593475648961 -0.0)
(-0.223054092951 -0.0586724392617 -0.0)
(-0.209360921318 -0.0579818268945 -0.0)
(-0.195470977721 -0.0572823885601 -0.0)
(-0.181395817656 -0.0565807562306 -0.0)
(-0.167147161562 -0.0558834993069 -0.0)
(-0.152736900198 -0.0551970901271 -0.0)
(-0.138177099505 -0.0545278690695 -0.0)
(-0.123480004736 -0.0538820095764 -0.0)
(-0.108658043697 -0.0532654834308 -0.0)
(-0.0936226091025 -0.052678728382 -0.0)
(-0.0783446436155 -0.0520799227275 -0.0)
(-0.0629854017226 -0.0514621886776 -0.0)
(-0.0475592882573 -0.0508294904952 -0.0)
(-0.0320808204691 -0.0501856639588 -0.0)
(-0.0165646168739 -0.0495343956832 -0.0)
(-0.00102538547076 -0.0488792042043 -0.0)
(0.0145220886489 -0.0482234230102 -0.0)
(0.0300629562654 -0.0475701856736 -0.0)
(0.045582317525 -0.0469224132079 -0.0)
(0.061065235919 -0.0462828037412 -0.0)
(0.0764967526939 -0.045653824566 -0.0)
(0.0918619016384 -0.0450377065918 -0.0)
(0.10714572419 -0.0444364411968 -0.0)
(0.122333284808 -0.0438517794393 -0.0)
(0.137409686545 -0.043285233563 -0.0)
(0.152360086782 -0.0427380806987 -0.0)
(0.167169713058 -0.0422113686411 -0.0)
(0.18182387896 -0.0417059235522 -0.0)
(0.196308000023 -0.0412223594234 -0.0)
(0.210607609607 -0.0407610891102 -0.0)
(0.224708374731 -0.0403223367384 -0.0)
(0.238596111813 -0.0399061512681 -0.0)
(0.252256802328 -0.0395124209949 -0.0)
(0.265676608349 -0.0391408887645 -0.0)
(0.278841887968 -0.0387911676742 -0.0)
(0.291739210603 -0.0384627570387 -0.0)
(0.304355372176 -0.0381550584045 -0.0)
(0.316677410176 -0.0378673914046 -0.0)
(0.328692618605 -0.0375990092604 -0.0)
(0.340388562817 -0.0373491137496 -0.0)
(0.351753094257 -0.0371168694788 -0.0)
(0.362774365095 -0.0369014173168 -0.0)
(0.373440842764 -0.0367018868678 -0.0)
(0.38374132441 -0.036517407882 -0.0)
(0.393664951222 -0.0363471205289 -0.0)
(0.403201222661 -0.0361901844774 -0.0)
(0.412340010558 -0.0360457867527 -0.0)
(0.421071573054 -0.0359131483616 -0.0)
(0.429386568373 -0.0357915297004 -0.0)
(0.437276068374 -0.0356802347797 -0.0)
(0.44473157186 -0.0355786143203 -0.0)
(0.451745017586 -0.0354860677916 -0.0)
(0.458308796918 -0.0354020444798 -0.0)
(0.464415766096 -0.0353260436849 -0.0)
(0.47005925803 -0.0352576141586 -0.0)
(0.475233093568 -0.0351963529004 -0.0)
(0.479931592188 -0.0351419034375 -0.0)
(0.484149582025 -0.0350939537138 -0.0)
(0.487882409181 -0.0350522337165 -0.0)
(0.49112594626 -0.0350165129629 -0.0)
(0.493876600052 -0.0349865979668 -0.0)
(0.496131318327 -0.0349623297955 -0.0)
(0.497887595668 -0.0349435818191 -0.0)
(0.499143478322 -0.0349302577401 -0.0)
(0.499897568002 -0.0349222899801 -0.0)
(0.500149024632 -0.0349196384831 -0.0)
)
spline 8 9
(
(-0.500149024632 -0.0321447832314 -0.0)
(-0.499944473182 -0.0293085325229 -0.0)
(-0.499235966606 -0.0264122815252 -0.0)
(-0.49802264556 -0.0234581595197 -0.0)
(-0.496304151782 -0.0204490201953 -0.0)
(-0.494080635029 -0.0173884270047 -0.0)
(-0.491352760848 -0.0142806337072 -0.0)
(-0.488121719042 -0.0111305602583 -0.0)
(-0.484389232675 -0.00794376424475 -0.0)
(-0.48015756746 -0.0047264080935 -0.0)
(-0.475429541303 -0.00148522231979 -0.0)
(-0.470208533812 0.00177253489453 0.0)
(-0.464498495537 0.0050391214725 0.0)
(-0.458303956702 0.00830635821975 0.0)
(-0.451630035202 0.0115656782435 0.0)
(-0.444482443612 0.0148081786304 0.0)
(-0.43686749499 0.018024673986 0.0)
(-0.428792107241 0.0212057514282 0.0)
(-0.420263805834 0.0243418266194 0.0)
(-0.411290724676 0.0274232004201 0.0)
(-0.401881604979 0.0304401157448 0.0)
(-0.392045791965 0.0333828142099 0.0)
(-0.38179322929 0.0362415921666 0.0)
(-0.371134451107 0.0390068557286 0.0)
(-0.360080571689 0.0416691744177 0.0)
(-0.348643272609 0.0442193330718 0.0)
(-0.336834787468 0.0466483816819 0.0)
(-0.324667884226 0.0489476828513 0.0)
(-0.31215584519 0.0511089566003 0.0)
(-0.299312444793 0.0531243222693 0.0)
(-0.286151925274 0.0549863373102 0.0)
(-0.272688970439 0.0566880327892 0.0)
(-0.25893867768 0.0582229454621 0.0)
(-0.244916528464 0.0595851463211 0.0)
(-0.230638357525 0.0607692655507 0.0)
(-0.216120320983 0.0617705138658 0.0)
(-0.20137886365 0.0625847002462 0.0)
(-0.186430685765 0.0632082461124 0.0)
(-0.17129270942 0.0636381960264 0.0)
(-0.155982044913 0.063872225028 0.0)
(-0.140515957271 0.0639086427491 0.0)
)
spline 9 11
(
(-0.140515957271 0.0639086427491 0.0)
(-0.124911833166 0.0637463944711 0.0)
(-0.109187148436 0.0633850593135 0.0)
(-0.0934606562199 0.0628306052367 0.0)
(-0.0777917721614 0.0621352037703 0.0)
(-0.0620497825783 0.0613131824886 0.0)
(-0.0462509757978 0.0603672663452 0.0)
(-0.0304116497969 0.0593004735741 0.0)
(-0.0145480929409 0.0581161002639 0.0)
(0.00132343473413 0.0568177050158 0.0)
(0.0171867196926 0.0554090938541 0.0)
(0.0330256125273 0.0538943055321 0.0)
(0.0488240450569 0.0522775973548 0.0)
(0.0645660469087 0.050563431616 0.0)
(0.0802357616097 0.0487564627181 0.0)
(0.0958174622107 0.0468615250205 0.0)
(0.111295566469 0.0448836214347 0.0)
(0.12665465162 0.0428279127595 0.0)
(0.141879468758 0.0406997077264 0.0)
(0.156954956857 0.0385044537012 0.0)
(0.171866256451 0.0362477279688 0.0)
(0.186598722988 0.0339352295103 0.0)
(0.201137939876 0.0315727711632 0.0)
(0.215469731221 0.0291662720466 0.0)
(0.229580174272 0.0267217501194 0.0)
(0.243455611552 0.0242453147379 0.0)
(0.257082662685 0.0217431590704 0.0)
(0.270448235894 0.0192215522311 0.0)
(0.283539539148 0.0166868309969 0.0)
(0.296344090953 0.0141453909764 0.0)
(0.308849730741 0.0116036771117 0.0)
(0.321044628836 0.00906817340469 0.0)
(0.332917295982 0.0065453917749 0.0)
(0.344456592375 0.0040418599719 0.0)
(0.355651736192 0.00156410848615 0.0)
(0.36649231159 -0.00088134357904 -0.0)
(0.37696827613 -0.00328800368924 -0.0)
(0.387069967629 -0.00564942210665 -0.0)
(0.396788110417 -0.00795920913363 -0.0)
(0.406113820977 -0.0102110533187 -0.0)
(0.41503861298 -0.0123987405498 -0.0)
(0.423554401711 -0.0145161739371 -0.0)
(0.431653507895 -0.0165573943687 -0.0)
(0.439328660934 -0.0185166016036 -0.0)
(0.446573001592 -0.0203881757472 -0.0)
(0.453380084144 -0.0221666989447 -0.0)
(0.459743878029 -0.0238469771108 -0.0)
(0.465658769055 -0.0254240615072 -0.0)
(0.471119560188 -0.0268932699726 -0.0)
(0.476121471991 -0.028250207605 -0.0)
(0.480660142752 -0.0294907866966 -0.0)
(0.484731628367 -0.0306112457232 -0.0)
(0.488332402021 -0.0316081671947 -0.0)
(0.491459353732 -0.0324784941831 -0.0)
(0.494109789806 -0.0332195453542 -0.0)
(0.496281432251 -0.0338290283424 -0.0)
(0.497972418198 -0.0343050513252 -0.0)
(0.499181299369 -0.0346461326722 -0.0)
(0.499907041627 -0.0348512085618 -0.0)
(0.500149024632 -0.0349196384831 -0.0)
(0.500149024632 -0.0349196384831 -0.0)
)
BSpline 20 22
(
(-0.500149024632 -0.0321447832314 0.2)
(-0.499850975368 -0.0349196384831 0.2)
(-0.499059486471 -0.0375958362434 0.2)
(-0.497784205983 -0.0401365768541 0.2)
(-0.496027948734 -0.0425418503814 0.2)
(-0.493794006491 -0.0448118299513 0.2)
(-0.49108613955 -0.0469468720096 0.2)
(-0.487908566437 -0.0489475177931 0.2)
(-0.484265951827 -0.0508144959413 0.2)
(-0.480163392824 -0.0525487261542 0.2)
(-0.475606403738 -0.0541513237815 0.2)
(-0.470600899572 -0.0556236052064 0.2)
(-0.465153178388 -0.0569670938722 0.2)
(-0.459269902813 -0.0581835267802 0.2)
(-0.452958080884 -0.0592748612751 0.2)
(-0.4462250465 -0.060243281922 0.2)
(-0.439078439723 -0.0610912072686 0.2)
(-0.431526187169 -0.0618212962806 0.2)
(-0.423576482751 -0.0624364542334 0.2)
(-0.415237768997 -0.0629398378421 0.2)
(-0.406518719177 -0.0633348594147 0.2)
(-0.397428220435 -0.063625189816 0.2)
(-0.387975358133 -0.06381476004 0.2)
(-0.378169401548 -0.063907761199 0.2)
(-0.368019791077 -0.0639086427491 0.2)
)
BSpline 22 23
(
(-0.368019791077 -0.0639086427491 0.2)
(-0.357536127051 -0.0638221087944 0.2)
(-0.346728160234 -0.0636531123246 0.2)
(-0.335605784057 -0.063406847271 0.2)
(-0.324179028592 -0.0630887382842 0.2)
(-0.312458056259 -0.0627044281685 0.2)
(-0.3004531592 -0.0622597629361 0.2)
(-0.288174758236 -0.0617607744725 0.2)
(-0.275633403315 -0.0612136608411 0.2)
(-0.262839775276 -0.0606247642837 0.2)
(-0.249804688807 -0.0600005470095 0.2)
(-0.236539096375 -0.0593475648961 0.2)
(-0.223054092951 -0.0586724392617 0.2)
(-0.209360921318 -0.0579818268945 0.2)
(-0.195470977721 -0.0572823885601 0.2)
(-0.181395817656 -0.0565807562306 0.2)
(-0.167147161562 -0.0558834993069 0.2)
(-0.152736900198 -0.0551970901271 0.2)
(-0.138177099505 -0.0545278690695 0.2)
(-0.123480004736 -0.0538820095764 0.2)
(-0.108658043697 -0.0532654834308 0.2)
(-0.0936226091025 -0.052678728382 0.2)
(-0.0783446436155 -0.0520799227275 0.2)
(-0.0629854017226 -0.0514621886776 0.2)
(-0.0475592882573 -0.0508294904952 0.2)
(-0.0320808204691 -0.0501856639588 0.2)
(-0.0165646168739 -0.0495343956832 0.2)
(-0.00102538547076 -0.0488792042043 0.2)
(0.0145220886489 -0.0482234230102 0.2)
(0.0300629562654 -0.0475701856736 0.2)
(0.045582317525 -0.0469224132079 0.2)
(0.061065235919 -0.0462828037412 0.2)
(0.0764967526939 -0.045653824566 0.2)
(0.0918619016384 -0.0450377065918 0.2)
(0.10714572419 -0.0444364411968 0.2)
(0.122333284808 -0.0438517794393 0.2)
(0.137409686545 -0.043285233563 0.2)
(0.152360086782 -0.0427380806987 0.2)
(0.167169713058 -0.0422113686411 0.2)
(0.18182387896 -0.0417059235522 0.2)
(0.196308000023 -0.0412223594234 0.2)
(0.210607609607 -0.0407610891102 0.2)
(0.224708374731 -0.0403223367384 0.2)
(0.238596111813 -0.0399061512681 0.2)
(0.252256802328 -0.0395124209949 0.2)
(0.265676608349 -0.0391408887645 0.2)
(0.278841887968 -0.0387911676742 0.2)
(0.291739210603 -0.0384627570387 0.2)
(0.304355372176 -0.0381550584045 0.2)
(0.316677410176 -0.0378673914046 0.2)
(0.328692618605 -0.0375990092604 0.2)
(0.340388562817 -0.0373491137496 0.2)
(0.351753094257 -0.0371168694788 0.2)
(0.362774365095 -0.0369014173168 0.2)
(0.373440842764 -0.0367018868678 0.2)
(0.38374132441 -0.036517407882 0.2)
(0.393664951222 -0.0363471205289 0.2)
(0.403201222661 -0.0361901844774 0.2)
(0.412340010558 -0.0360457867527 0.2)
(0.421071573054 -0.0359131483616 0.2)
(0.429386568373 -0.0357915297004 0.2)
(0.437276068374 -0.0356802347797 0.2)
(0.44473157186 -0.0355786143203 0.2)
(0.451745017586 -0.0354860677916 0.2)
(0.458308796918 -0.0354020444798 0.2)
(0.464415766096 -0.0353260436849 0.2)
(0.47005925803 -0.0352576141586 0.2)
(0.475233093568 -0.0351963529004 0.2)
(0.479931592188 -0.0351419034375 0.2)
(0.484149582025 -0.0350939537138 0.2)
(0.487882409181 -0.0350522337165 0.2)
(0.49112594626 -0.0350165129629 0.2)
(0.493876600052 -0.0349865979668 0.2)
(0.496131318327 -0.0349623297955 0.2)
(0.497887595668 -0.0349435818191 0.2)
(0.499143478322 -0.0349302577401 0.2)
(0.499897568002 -0.0349222899801 0.2)
(0.500149024632 -0.0349196384831 0.2)
)
BSpline 20 21
(
(-0.500149024632 -0.0321447832314 0.2)
(-0.499944473182 -0.0293085325229 0.2)
(-0.499235966606 -0.0264122815252 0.2)
(-0.49802264556 -0.0234581595197 0.2)
(-0.496304151782 -0.0204490201953 0.2)
(-0.494080635029 -0.0173884270047 0.2)
(-0.491352760848 -0.0142806337072 0.2)
(-0.488121719042 -0.0111305602583 0.2)
(-0.484389232675 -0.00794376424475 0.2)
(-0.48015756746 -0.0047264080935 0.2)
(-0.475429541303 -0.00148522231979 0.2)
(-0.470208533812 0.00177253489453 0.2)
(-0.464498495537 0.0050391214725 0.2)
(-0.458303956702 0.00830635821975 0.2)
(-0.451630035202 0.0115656782435 0.2)
(-0.444482443612 0.0148081786304 0.2)
(-0.43686749499 0.018024673986 0.2)
(-0.428792107241 0.0212057514282 0.2)
(-0.420263805834 0.0243418266194 0.2)
(-0.411290724676 0.0274232004201 0.2)
(-0.401881604979 0.0304401157448 0.2)
(-0.392045791965 0.0333828142099 0.2)
(-0.38179322929 0.0362415921666 0.2)
(-0.371134451107 0.0390068557286 0.2)
(-0.360080571689 0.0416691744177 0.2)
(-0.348643272609 0.0442193330718 0.2)
(-0.336834787468 0.0466483816819 0.2)
(-0.324667884226 0.0489476828513 0.2)
(-0.31215584519 0.0511089566003 0.2)
(-0.299312444793 0.0531243222693 0.2)
(-0.286151925274 0.0549863373102 0.2)
(-0.272688970439 0.0566880327892 0.2)
(-0.25893867768 0.0582229454621 0.2)
(-0.244916528464 0.0595851463211 0.2)
(-0.230638357525 0.0607692655507 0.2)
(-0.216120320983 0.0617705138658 0.2)
(-0.20137886365 0.0625847002462 0.2)
(-0.186430685765 0.0632082461124 0.2)
(-0.17129270942 0.0636381960264 0.2)
(-0.155982044913 0.063872225028 0.2)
(-0.140515957271 0.0639086427491 0.2)
)
BSpline 21 23
(
(-0.140515957271 0.0639086427491 0.2)
(-0.124911833166 0.0637463944711 0.2)
(-0.109187148436 0.0633850593135 0.2)
(-0.0934606562199 0.0628306052367 0.2)
(-0.0777917721614 0.0621352037703 0.2)
(-0.0620497825783 0.0613131824886 0.2)
(-0.0462509757978 0.0603672663452 0.2)
(-0.0304116497969 0.0593004735741 0.2)
(-0.0145480929409 0.0581161002639 0.2)
(0.00132343473413 0.0568177050158 0.2)
(0.0171867196926 0.0554090938541 0.2)
(0.0330256125273 0.0538943055321 0.2)
(0.0488240450569 0.0522775973548 0.2)
(0.0645660469087 0.050563431616 0.2)
(0.0802357616097 0.0487564627181 0.2)
(0.0958174622107 0.0468615250205 0.2)
(0.111295566469 0.0448836214347 0.2)
(0.12665465162 0.0428279127595 0.2)
(0.141879468758 0.0406997077264 0.2)
(0.156954956857 0.0385044537012 0.2)
(0.171866256451 0.0362477279688 0.2)
(0.186598722988 0.0339352295103 0.2)
(0.201137939876 0.0315727711632 0.2)
(0.215469731221 0.0291662720466 0.2)
(0.229580174272 0.0267217501194 0.2)
(0.243455611552 0.0242453147379 0.2)
(0.257082662685 0.0217431590704 0.2)
(0.270448235894 0.0192215522311 0.2)
(0.283539539148 0.0166868309969 0.2)
(0.296344090953 0.0141453909764 0.2)
(0.308849730741 0.0116036771117 0.2)
(0.321044628836 0.00906817340469 0.2)
(0.332917295982 0.0065453917749 0.2)
(0.344456592375 0.0040418599719 0.2)
(0.355651736192 0.00156410848615 0.2)
(0.36649231159 -0.00088134357904 0.2)
(0.37696827613 -0.00328800368924 0.2)
(0.387069967629 -0.00564942210665 0.2)
(0.396788110417 -0.00795920913363 0.2)
(0.406113820977 -0.0102110533187 0.2)
(0.41503861298 -0.0123987405498 0.2)
(0.423554401711 -0.0145161739371 0.2)
(0.431653507895 -0.0165573943687 0.2)
(0.439328660934 -0.0185166016036 0.2)
(0.446573001592 -0.0203881757472 0.2)
(0.453380084144 -0.0221666989447 0.2)
(0.459743878029 -0.0238469771108 0.2)
(0.465658769055 -0.0254240615072 0.2)
(0.471119560188 -0.0268932699726 0.2)
(0.476121471991 -0.028250207605 0.2)
(0.480660142752 -0.0294907866966 0.2)
(0.484731628367 -0.0306112457232 0.2)
(0.488332402021 -0.0316081671947 0.2)
(0.491459353732 -0.0324784941831 0.2)
(0.494109789806 -0.0332195453542 0.2)
(0.496281432251 -0.0338290283424 0.2)
(0.497972418198 -0.0343050513252 0.2)
(0.499181299369 -0.0346461326722 0.2)
(0.499907041627 -0.0348512085618 0.2)
(0.500149024632 -0.0349196384831 0.2)
(0.500149024632 -0.0349196384831 0.2)
)
);
boundary
(
    
    inlet
{
        type patch;
faces
(
        (7 0 12 19)
        (0 1 13 12)
    );
}
    
    outlet
{
        type patch;
faces
(
        (4 5 17 16)
        (3 4 16 15)
        (6 7 19 18)
        (5 6 18 17)
        (2 3 15 14)
        (1 2 14 13)
    );
}
    
    walls
{
        type wall;
faces
(
        (8 10 22 20)
        (10 11 23 22)
        (8 9 21 20)
        (9 11 23 21)
    );
}
    
    frontAndBack
{
        type empty;
faces
(
        (8 0 1 10)
        (11 10 1 2)
        (4 11 2 3)
        (7 0 8 9)
        (6 7 9 11)
        (5 6 11 4)
        (20 12 13 22)
        (23 22 13 14)
        (16 23 14 15)
        (19 12 20 21)
        (18 19 21 23)
        (17 18 23 16)
    );
}
);

mergePatchPairs
(
);
