tutorials/16geomParNS_review/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       87958;
    }
    outlet
    {
        type            patch;
        nFaces          542;
        startFace       88058;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          242;
        startFace       88600;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          88400;
        startFace       88842;
    }
)

// ************************************************************************* //
